curl_xml/run.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://wsiv.ratp.fr/xsd" xmlns:wsiv="http://wsiv.ratp.fr">
    <soapenv:Header/>
    <soapenv:Body>
        <wsiv:getLines>
            <wsiv:line>
                <xsd:id>RA</xsd:id>
                <wsiv:reseau>
                    <xsd:code>R</xsd:code>
                </wsiv:reseau>
            </wsiv:line>
        </wsiv:getLines>
    </soapenv:Body>
</soapenv:Envelope>